Repository: coryphoenixxx/TeleXKCDbot
Catalog: projects/bot/src/locales/*/LC_MESSAGES/telexkcdbot.po
Languages: ru

source: ❗ <b>There's no explanation yet or explainxkcd.com is unavailable. Try it later.</b>
ru: ❗ <b>Объяснение еще не появилось или explainxkcd.com недоступен. Попробуйте позже.</b>

source: ❗ <b>This comic is special! Better to view it in your browser.</b>
ru: ❗ <b>Этот комикс особенный! Лучше посмотреть его в браузере.</b>

source: ❗ <b>Couldn't get image. Press on title to view comic in your browser!</b>
ru: ❗ <b>Не смог получить изображение. Нажмите на ссылку в названии комикса, чтобы посмотреть его в браузере!</b>

source: <Prev
ru: <Туда

source: 🎲Rand
ru: 🎲Случ

source: Next>
ru: Сюда>

source: ❤Bookmark
ru: ❤Добавить

source: 💔Unbookmark
ru: 💔Убрать

source: 📜Explain
ru: 📜Суть

source: ↩Break
ru: ↩Прекратить

source: Forward>
ru: Дальше>

source: 🔔 Enable notification sound
ru: 🔔 Звук уведомления вкл.

source: 🔕 Disable notification sound
ru: 🔕 Звук уведомления выкл.

source: 📑 My Bookmarks
ru: 📑 Моё избранное

source: Add 🇷🇺RU/🇬🇧EN Button
ru: Добавить 🇷🇺RU/🇬🇧EN кнопку

source: 💬 Admin Support
ru: 💬 Связь с админом

source: Remove 🇷🇺RU/🇬🇧EN Button
ru: Убрать 🇷🇺RU/🇬🇧EN кнопку

source: Start xkcding!
ru: Начать

source: Continue xkcding!
ru: Продолжить

source: Menu
ru: Меню

source: ❗ <b>For admin only!</b>
ru: ❗ <b>Только для админа!</b>

source: ❗ <b>The message has been successfully sent to the admin.</b>
ru: ❗ <b>Сообщение админу было успешно отправлено.</b>

source: Start/restart bot + change language
ru: Старт/рестарт бота + смена языка

source: Show my bookmarks
ru: Показать моё избранное

source: Show menu
ru: Показать меню

source: <b>❗ Hello, {}!
ru: <b>❗ Приветствую, {}!

source: <b>❗ Hello!
ru: <b>❗ Приветствую!

source: I'm {} — functional telegram bot for handy reading xkcd comics. <i><a href='https://github.com/coryphoenixxx/telexkcdbot'>[Source code]</a></i></b>
ru: Я {} — функциональный телеграм-бот для удобного чтения xkcd комиксов. <i><a href='https://github.com/coryphoenixxx/projects'>[Исходник]</a></i></b>

source: ❗ <b>Type and send a message (about bugs or suggestions, please). You can send a screenshot too.</b>
ru: ❗ <b>Введите и и отправьте сообщение (пожалуйста, насчет багов или предложений). Скриншоты тоже можно присылать.</b>

source: ❗ <b>You did it. You broke my search engine. You can be proud of yourself! Here's your award:</b>
ru: ❗ <b>Тебе это удалось. Ты накрыл мою поисковую систему. Можешь гордиться собой! Вот твоя награда:</b>

source: ❗ <b>Please, enter a number from 1 to {}!</b>
ru: ❗ <b>Пожалуйста, введите число от 1 до {}!</b>

source: ❗ <b>I think there's no necessity to search by one character!</b>
ru: ❗ <b>Я думаю нет никакой необходимости искать по одной букве!</b>

source: ❗ <b>There's no such comic title or command!</b>
ru: ❗ <b>Нет такого комикса или такой команды!</b>

source: ❗ <b>I found one:</b>
ru: ❗ <b>Есть один у меня:</b>

source: ❗ <b>I found <u><b>{}</b></u> comics:</b>
ru: ❗ <b>Нашел <u><b>{}</b></u> комиксов:</b>

source: ❗ <b>Now you can flip through the comics:</b>
ru: ❗ <b>Теперь можно перелистывать:</b>

source: ❗ <b>You have no bookmarks. You can bookmark a comic with the ❤ press.</b>
ru: ❗ <b>У вас нет комиксов в избранном. Можете добавить нажатием ❤ под комиксом.</b>

source: ❗ <b>You have one:</b>
ru: ❗ <b>У вас один комикс в избранном:</b>

source: ❗ <b>You have <u><b>{}</b></u> bookmarks:</b>
ru: ❗ <b>У вас <u><b>{}</b></u> комиксов в избранном:</b>

source: <b>***** MENU *****</b> • send me the <u><b>number</b></u>, and I'll find a comic with this number; • send me the <u><b>word</b></u>, and I'll find comics whose titles contains this word. <u><b>Menu options:</b></u> • adjust the notification sound for the new comic release <i>(every Mon, Wed and Fri USA time)</i>; • view comics from your bookmarks; • remove language button <i>(under the comic, which have russian translation)</i> if you don't need it; • contact admin. ____________________
ru: <b>***** МЕНЮ *****</b> • отправьте мне <u><b>число</b></u>, и я найду комикс с таким номером; • отправьте мне <u><b>слово</b></u>, и я найду комиксы с таким словом в заголовке. <u><b>Опции меню:</b></u> • можно настроить звук уведомлений на рассылку свежего выпуска <i>(каждый Пон, Ср и Пт по времени в США (в РФ обычно после полуночи по МСК))</i>; • можно просмотреть комиксы из избранного; • убрать кнопку смены языка комикса <i>(под комиксами, у которых есть русский перевод)</i>, если она вам не нужна. • написать админу. В режиме "Только переводы" я буду присылать сначала перевод, если он есть. ❗ В этом режиме свежие комиксы присылаться <u><b>не будут</b></u>. ____________________

source: ❗ <b>The last one:</b>
ru: ❗ <b>Этот последний:</b>

source: ❗ <b>Sorry, I was rebooted and forgot all the data... 😢 Please repeat your request.</b>
ru: ❗ <b>К сожалению, я был перезагружен и забыл ваш запрос... 😢 Пожалуйста повторите его.</b>

source: ❗❗❗ <b>Too many requests!</b>
ru: ❗❗❗ <b>Слишком частые запросы!</b>

source: ❗ <b>Unlocked.</b>
ru: ❗ <b>Продолжайте.</b>
